(function (){
// Написати умовну конструкцію, яка в залежності від часу доби виводитиме відповідне привітання.
// Потрібно отримати реальний час доби із системи. Зробити 2 способами через 2 різних умовних оператора.
// В діапазоні годин 23-5 – має виводитися привітання “Доброї ночі”
// В діапазоні годин 5-11 – має виводитися привітання “Доброго ранку”
// В діапазоні годин 11-17 – має виводитися привітання “Доброго дня”
// В діапазоні годин 17-23 – має виводитися привітання “Доброго вечора”.
    // перший варіант
    const now = new Date()
    const hournow = now.getHours()
 //   if (hournow >= 23 || hournow < 5){
 //       console.log("Доброї ночі");
 //   } else if(hournow > 5 && hournow < 11){
 //       console.log("Доброго ранку");
 //   } else if (hournow > 11 && hournow < 17){
 //       console.log("Доброго дня");
 //   } else if (hournow > 17 && hournow < 23){
 //       console.log("Дорого вечора");
 //   }



    //другий варіант
    switch (true){
        case (hournow >= 23 || hournow < 5):
        console.log("Доброї ночі");
        break;
        case (hournow > 5 && hournow < 11):
        console.log("Доброго ранку");
        break;
        case (hournow > 11 && hournow < 17):
        console.log("Доброго дня");
        break;
        default:
            console.log("Доброї ночі");
            break;
    }
})()